; domain
(define (domain test-RL)
  (:requirements :typing :equality :strips)

  (:types
    wire robot location workspace ; location is the place that wire can be locked, work space means that the place robotic arm can pickup the wire.
  )

  (:predicates
    (holding ?wire - wire)
    (on ?wire - wire ?space - workspace)
    (locked ?wire - wire ?loc - location)
    (inserted ?wire - wire ?loc - location)
    (arm-empty ?arm - robot)
    (is-arm2 ?arm - robot)
    (is-arm1 ?arm - robot)
    (move-right ?arm - robot)
    (move-left ?arm - robot)
    (move-forward ?arm - robot)
    (move-backward ?arm - robot)
    (move-home ?arm - robot)
    (find ?wire - wire)  
  )

  (:action pickup
    :parameters
      (?arm - robot
       ?wire - wire
       ?space - workspace)
    :precondition
      (and
        (on ?wire ?space)
        (arm-empty ?arm)
        (find ?wire)
      )
    :effect
      (and
        (not (on ?space ?wire))
        (holding ?wire)
        (not (arm-empty ?arm))
      )
  )

  (:action putdown
    :parameters
      (?arm - robot
       ?wire - wire
       ?space - workspace)
    :precondition
      (and
        (holding ?wire)
        (is-arm1 ?arm)
        (find ?wire)
      )
    :effect
      (and
        (on ?wire ?space)
        (arm-empty ?arm)
        (not (holding ?wire))
      )
  )

  (:action lock
    :parameters
      (?arm - robot
       ?wire - wire
       ?loc - location)
    :precondition
      (and
        (inserted ?wire ?loc)
        (is-arm2 ?arm)
        (find ?wire)
      )
    :effect
      (and
        (locked ?wire ?loc)
        (arm-empty arm1)
        (not(inserted ?wire ?loc))
      )
  )

  (:action insert
    :parameters
      (?arm - robot
       ?wire - wire
       ?loc - location)
    :precondition
      (and
        (find ?wire)
        (holding ?wire)
        (is-arm1 ?arm)
      )
    :effect
      (and
        (inserted ?wire ?loc)
        (not (holding ?wire))
      )
  )

  (:action find
    :parameters
      (?wire - wire)
    :precondition
      (and)
    :effect
      (and
        (find ?wire)
      )
  )

  (:action move-forward
    :parameters (?arm - robot)
    :precondition (and) 
    :effect (and (move-forward ?arm))
  )

  (:action move-backward
    :parameters (?arm - robot)
    :precondition (and) 
    :effect (and (move-backward ?arm))
  )

  (:action move-right
    :parameters (?arm - robot)
    :precondition (and) 
    :effect (and (move-right ?arm))
  )

  (:action move-left
    :parameters (?arm - robot)
    :precondition (and) 
    :effect (and (move-left ?arm))
  )

  (:action move-home
    :parameters (?arm - robot)
    :precondition (and) 
    :effect (and (move-home ?arm))
  )
  
)

; problem
(define (problem install-two-wires)
    (:domain test-RL)
    (:objects
        arm1 - robot
        arm2 - robot
        red_wire - wire
        blue_wire - wire
        power_supply_1 - location
        power_supply_2 - location
        table - workspace
    )

    (:init
        (arm-empty arm1)
        (on red_wire table)
        (on blue_wire table)
        (is-arm2 arm2)
        (is-arm1 arm1)
    )

    (:goal 
        (and
            (locked red_wire power_supply_2)
            (locked blue_wire power_supply_1)
        )
    )
)

; plan
1. (find blue_wire)
   added: (find blue_wire)
   goals met: 0 of 2
2. (find red_wire)
   added: (find red_wire)
   goals met: 0 of 2
3. (pickup arm1 blue_wire table)
   deleted: (arm-empty arm1)
   added: (holding blue_wire)
   goals met: 0 of 2
4. (insert arm1 blue_wire power_supply_1)
   deleted: (holding blue_wire)
   added: (inserted blue_wire power_supply_1)
   goals met: 0 of 2
5. (lock arm2 blue_wire power_supply_1)
   deleted: (inserted blue_wire power_supply_1)
   added: (locked blue_wire power_supply_1) (arm-empty arm1)
   goals met: 1 of 2
6. (pickup arm1 red_wire table)
   deleted: (arm-empty arm1)
   added: (holding red_wire)
   goals met: 1 of 2
7. (insert arm1 red_wire power_supply_2)
   deleted: (holding red_wire)
   added: (inserted red_wire power_supply_2)
   goals met: 1 of 2
8. (lock arm2 red_wire power_supply_2)
   deleted: (inserted red_wire power_supply_2)
   added: (locked red_wire power_supply_2) (arm-empty arm1)
   goals met: 2 of 2
